Tekla Open API Reference for Tekla Structures 2025
Operation.MoveObject Method
 Moves the analysis object by translation vector. Supported objects are: AnalysisNode, AnalysisPart.
 Namespace: Tekla.Structures.Analysis.Operations
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool MoveObject(
	AnalysisObject analysisObject,
	Vector translation
)
Public Shared Function MoveObject (
	analysisObject As AnalysisObject,
	translation As Vector
) As Boolean
Parameters
analysisObject
Type: Tekla.Structures.Analysis.AnalysisObject
The analysis object to move.
translation
Type: Tekla.Structures.Geometry3d.Vector
The vector for moving the object.
Return Value
Type: Boolean
True on success, false on failure.
See Also
Reference
Operation Class
Tekla.Structures.Analysis.Operations Namespace